zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_gatt_aci.h
ble_status_t aci_gatt_clt_read(uint16_t connection_handle,
                               uint16_t attr_handle);
/**
  * @brief Starts the procedure to read all the characteristics specified by the
  *        UUID. When the procedure is completed, a @ref
  *        aci_gatt_clt_proc_complete_event event is generated. Before procedure
  *        completion the response packets are given through @ref
  *        aci_gatt_clt_disc_read_char_by_uuid_resp_event event.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param start_handle Starting handle of the range to be searched
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param end_handle End handle of the range to be searched
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param uuid_type UUID type.
  *        Values:
  *        - 0x01: 16-bit UUID
  *        - 0x02: 128-bit UUID
  * @param uuid See @ref uuid_t
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_clt_read_using_char_uuid(uint16_t connection_handle,
                                               uint16_t start_handle,
                                               uint16_t end_handle,
                                               uint8_t uuid_type,
                                               uuid_t *uuid);
/**
  * @brief Starts the procedure to read a long attribute value. the procedure is
  *        completed, a @ref aci_gatt_clt_proc_complete_event event is generated.
  *        Before procedure completion the response packets are given through
  *        @ref aci_att_clt_read_blob_resp_event event.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Handle of the attribute to be read
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param val_offset Offset from which the value needs to be read
  *        Values:
  *        - 0 ... 511
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_clt_read_long(uint16_t connection_handle,
                                    uint16_t attr_handle,
                                    uint16_t val_offset);
/**
  * @brief Starts a procedure to read multiple characteristic values from a
  *        server. This sub-procedure is used to read multiple Characteristic
  *        Values from a server when the client knows the Characteristic Value
  *        Handles. When the procedure is completed, a @ref
  *        aci_gatt_clt_proc_complete_event event is generated. Before procedure
  *        completion the response packets are given through @ref
  *        aci_att_clt_read_multiple_resp_event event.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param number_of_handles The number of handles for which the value has to be
  *        read. From 2 to (ATT_MTU-1)/2
  *        Values:
  *        - 0x02 ... 0xFF
  * @param handle_entry See @ref handle_entry_t
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_clt_read_multiple_char_value(uint16_t connection_handle,
                                                   uint8_t number_of_handles,
                                                   handle_entry_t handle_entry[]);
/**
  * @brief Starts the procedure to write an attribute (characteristic value or
  *        descriptor). When the procedure is completed, a @ref
  *        aci_gatt_clt_proc_complete_event event is generated.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Handle of the attribute to be written
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param attribute_val_length Length of the value to be written
  * @param attribute_val Value to be written
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_clt_write_nwk(uint16_t connection_handle,
                                    uint16_t attr_handle,
                                    uint16_t attribute_val_length,
                                    uint8_t attribute_val[]);
/**
  * @brief Starts the procedure to write a long attribute value (i.e. an
  *        attribute with a length greater than the current ATT MTU). When the
  *        procedure is completed, a @ref aci_gatt_clt_proc_complete_event event
  *        is generated. During the procedure, @ref
  *        aci_att_clt_prepare_write_resp_event and @ref
  *        aci_att_clt_exec_write_resp_event events are raised.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Handle of the attribute to be written
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param val_offset Offset at which the attribute has to be written
  *        Values:
  *        - 0 ... 511
  * @param attribute_val_length Length of the value to be written
  * @param attribute_val Value to be written
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_clt_write_long_nwk(uint16_t connection_handle,
                                         uint16_t attr_handle,
                                         uint16_t val_offset,
                                         uint16_t attribute_val_length,
                                         uint8_t attribute_val[]);
/**
  * @brief Starts the procedure to write a characteristic reliably (a check is
  *        made on the written values). When the procedure is completed, a  @ref
  *        aci_gatt_clt_proc_complete_event event is generated. During the
  *        procedure, @ref aci_att_clt_prepare_write_resp_event and @ref
  *        aci_att_clt_exec_write_resp_event events are raised.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Handle of the attribute to be written
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param val_offset Offset at which the attribute has to be written
  *        Values:
  *        - 0 ... 511
  * @param attribute_val_length Length of the value to be written
  * @param attribute_val Value to be written
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_clt_write_char_reliable_nwk(uint16_t connection_handle,
                                                  uint16_t attr_handle,
                                                  uint16_t val_offset,
                                                  uint16_t attribute_val_length,
                                                  uint8_t attribute_val[]);
/**
  * @brief Starts the procedure to write a characteristic value without waiting
  *        for any response from the server. No events are generated after this
  *        command is executed. Writing attributes using this function is not
  *        considered reliable by the standard: packets may be discarded by the
  *        peer if too many write commands are received.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Handle of the attribute to be written
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param attribute_val_length Length of the value to be written (maximum value
  *        is ATT_MTU - 3)
  * @param attribute_val Value to be written
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_clt_write_without_resp(uint16_t connection_handle,
                                             uint16_t attr_handle,
                                             uint16_t attribute_val_length,
                                             uint8_t attribute_val[]);
/**
  * @brief Starts a signed write without response from the server. The procedure
  *        is used to write a characteristic value with an authentication
  *        signature without waiting for any response from the server. It cannot
  *        be used when the link is encrypted.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Handle of the attribute to be written
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param attribute_val_length Length of the value to be written (up to ATT_MTU
  *        - 13)
  * @param attribute_val Value to be written
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_clt_signed_write_without_resp(uint16_t connection_handle,
                                                    uint16_t attr_handle,
                                                    uint16_t attribute_val_length,
                                                    uint8_t attribute_val[]);
/**
  * @brief Allow application to confirm indication. This command has to be sent
  *        when the application receives the event @ref
  *        aci_gatt_clt_indication_event.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_clt_confirm_indication(uint16_t connection_handle);
/**
  * @brief This command sets the security permission for the attribute handle
  *        specified. Currently the setting of security permission is allowed
  *        only for client characteristic configuration descriptor.
  * @param attr_handle Handle of the attribute whose security permission has to
  *        be modified
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param security_permissions Security permission flags.
  *        Flags:
  *        - 0x00
  *        - 0x01: AUTHEN_READ (Need authentication to read)
  *        - 0x04: ENCRY_READ (Need encryption to read)
  *        - 0x08: AUTHEN_WRITE (need authentication to write)
  *        - 0x20: ENCRY_WRITE (need encryption to write)
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_srv_set_security_permission_nwk(uint16_t attr_handle,
                                                      uint8_t security_permissions);
/**
  * @brief Reads the value of the attribute handle specified from the local GATT
  *        database. Client Characteristic Configuration Descriptor is not
  *        supported.
  * @param attr_handle Handle of the attribute to read
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param offset Offset from which the value needs to be read
  *        Values:
  *        - 0 ... 511
  * @param value_length_requested Maximum number of octets to be returned as
  *        attribute value
  *        Values:
  *        - 0 ... 512
  * @param[out] length Length of the attribute value
  * @param[out] value_length Length in octets of the Value parameter
  * @param[out] value Attribute value
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_srv_read_handle_value_nwk(uint16_t attr_handle,
                                                uint16_t offset,
                                                uint16_t value_length_requested,
                                                uint16_t *length,
                                                uint16_t *value_length,
                                                uint8_t value[]);
/**
  * @brief This command sets the access permission for the attribute handle
  *        specified.
  * @param attr_handle Handle of the attribute whose security permission has to
  *        be modified
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param access_permissions Access permission
  *        Flags:
  *        - 0x00
  *        - 0x01: READ
  *        - 0x02: WRITE
  *        - 0x04: WRITE_NO_RESP
  *        - 0x08: SIGNED_WRITE
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_srv_set_access_permission_nwk(uint16_t attr_handle,
                                                    uint8_t access_permissions);
/**
  * @brief Send an indication or notification for the provided attribute handle.
  *        The Flags parameter indicate what kind of message will be sent: -)
  *        0x00 Send a notification -) 0x02 Send an indication
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Handle of the attribute to be notified
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param flags Select the notification type.
  *        Values:
  *        - 0x00: GATT_NOTIFICATION
  *        - 0x02: GATT_INDICATION
  * @param val_length Length of the Val field.
  * @param val
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_srv_notify(uint16_t connection_handle,
                                 uint16_t attr_handle,
                                 uint8_t flags,
                                 uint16_t val_length,
                                 uint8_t val[]);
/**
  * @brief Response to an aci_att_srv_exec_write_req_event.
  * @param conn_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param exec If 1, allow execution of queued writes. If 0 flush all queued
  *        writes for the given connection handle.
  *        Values:
  *        - 0x00: FLUSH
  *        - 0x01: EXECUTE
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_srv_exec_write_resp_nwk(uint16_t conn_handle,
                                              uint8_t exec);
/**
  * @brief This command should be sent when ACI_GATT_SRV_AUTHORIZE_NWK_EVENT is
  *        received.
  * @param conn_handle Connection handle to be used to identify the connection
  *        with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Offset from which the value needs to be read or write
  *        Values:
  *        - 0 ... 511
  * @param operation_type
  *        Values:
  *        - 0x00: Read
  *        - 0x10: Write Request
  *        - 0x11: Write Command or Signed Write Command
  *        - 0x12: Prepare Write Request
  * @param error_code Set to 0 if operation is authorized, otherwise error_code
  *        is the ATT error code that will be sent to the peer in reaponse to the
  *        request.
  *        Values:
  *        - 0: Authorize
  *        - 0 ... 255
  * @param attr_val_offset Offset from which the attribute needs to be read or
  *        written. For a read operation it is always 0.
  *        Values:
  *        - 0 ... 511
  * @param data_length Length of Data field
  * @param data The data that the client has requested to write.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_srv_authorize_resp_nwk(uint16_t conn_handle,
                                             uint16_t attr_handle,
                                             uint8_t operation_type,
                                             uint8_t error_code,
                                             uint16_t attr_val_offset,
                                             uint16_t data_length,
                                             uint8_t data[]);
/**
  * @brief Reads the content of the prepare write queue. This command should be
  *        used to atomically read all the queued write operations after a
  *        aci_att_srv_exec_write_req_event is received and before sending the
  *        aci_gatt_srv_exec_write_resp.
  * @param conn_handle Connection handle to be used to identify the connection
  *        with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param item_index The index of the entry in the queue for the selected
  *        connection handle.
  * @param[out] attr_handle The attribute handle of the returned entry.
  * @param[out] value_offset The offset from which the peer is requesting to
  *             start writing.
  * @param[out] value_length Length in octets of the Value parameter
  * @param[out] value The value to be written.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_srv_read_prepare_queue_nwk(uint16_t conn_handle,
                                                 uint8_t item_index,
                                                 uint16_t *attr_handle,
                                                 uint16_t *value_offset,
                                                 uint16_t *value_length,
                                                 uint8_t value[]);
/**
  * @brief Updates an attribute value for that kind of attributes that have
  *        different values for each connection, i.e. the Client Characteristic
  *        Configuration Descriptors. WARNING: use of this function can affect
  *        interoperability. Do not use the function unless you are aware of what
  *        you are doing.
  * @param connection_handle Connection handle for which the attribute value will
  *        be written.
  * @param attr_handle Handle of the attribute
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param value_length Length of the attribute value in octets.
  * @param value Attribute value.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_srv_write_multiple_instance_handle_value(uint16_t connection_handle,
                                                               uint16_t attr_handle,
                                                               uint16_t value_length,
                                                               uint8_t value[]);
/**
  * @brief Read the value for that kind of attributes that have different values
  *        for each connection, i.e. the Client Characteristic Configuration
  *        Descriptors.
  * @param connection_handle Connection handle for which the attribute value will
  *        be read.
  * @param attr_handle Handle of the attribute
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param[out] value_length Length of the attribute value in octets.
  * @param[out] value Attribute value.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gatt_srv_read_multiple_instance_handle_value_nwk(uint16_t connection_handle,
                                                                  uint16_t attr_handle,
                                                                  uint16_t *value_length,
                                                                  uint8_t value[]);
/**
     * @}
     */

#ifdef __cplusplus
}
#endif

#endif /* _STM32WB07_06_GATT_ACI_H_ */
